#pragma once



/////   template <typename T>    DZ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
/////   Создаем список Person  , тестируем в main : создали список, добавить Person , удалить, вівести на екран весь список  


class Node////структура що зберігає данні одного вузла(одиниця данних), це може бути і клас
{
public:
    // Данные.
   char m_data;////може бути елемент Person замість char   ( у шаблонах тип T)

   // Person obj;

    // Адрес следующего элемента списка.
    Node* m_next;//////обовязкове поле що звязує один екземпляр ланцюга данних з іншим

    Node(const char data);
};